blog/notes/productivity.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-03-28 Mon 14:14 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>生產力</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Chen Hsin-Yi" />
<link rel="stylesheet" type="text/css" href="/blog/css/readtheorg.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">生產力</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline5">Remapping Keyboard Keys On Mac</a>
<ul>
<li><a href="#orgheadline1">Gloal</a></li>
<li><a href="#orgheadline2">Why</a></li>
<li><a href="#orgheadline3">Remaps Capslock To Ctrl</a></li>
<li><a href="#orgheadline4">Remaps Capslock to Escape</a></li>
</ul>
</li>
<li><a href="#orgheadline6">Zsh Configuration</a>
<ul>
<li><a href="#orgheadline7">Installation</a></li>
<li><a href="#orgheadline8">Initialization</a></li>
<li><a href="#orgheadline9">Command Search PATH</a></li>
<li><a href="#orgheadline10">Default Editor</a></li>
<li><a href="#orgheadline11">VIM mode</a></li>
<li><a href="#orgheadline12">Theme</a></li>
<li><a href="#orgheadline13">Syntax Highlight</a></li>
<li><a href="#orgheadline14">History Search</a></li>
<li><a href="#orgheadline18">Git</a></li>
<li><a href="#orgheadline19">OSX Enhancement</a></li>
<li><a href="#orgheadline22">NodeJS Development Env</a></li>
<li><a href="#orgheadline23">Install plugins automatically</a></li>
<li><a href="#orgheadline24">Loads Zplug Plugins.</a></li>
<li><a href="#orgheadline28">Aliases &amp; Additonal Commands</a></li>
<li><a href="#orgheadline29">Put it all together</a></li>
</ul>
</li>
<li><a href="#orgheadline30">VIM Configuration</a>
<ul>
<li><a href="#orgheadline31">Syntax Highlight</a></li>
<li><a href="#orgheadline32">Highlight and strip eatra white spaces</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5">Remapping Keyboard Keys On Mac</h2>
<div class="outline-text-2" id="text-orgheadline5">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1">Gloal</h3>
<div class="outline-text-3" id="text-orgheadline1">
<ol class="org-ol">
<li>Remaps capslock to Ctrl.</li>
<li>Remaps casplock to Escape.</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2">Why</h3>
<div class="outline-text-3" id="text-orgheadline2">
<ol class="org-ol">
<li>I am a fan of <b>Emacs</b> but prefer <b>VIM style editing</b> (which leads me to start using spacemacs), 
I'll use <b>Ctrl</b> and <b>Escape</b> very very often.</li>
<li>The default layout of Mac keyboard does not work very well to me.</li>
<li>Capslock is useless, I never use it. Luckly, it seems a good place to put <b>Ctrl/Escape</b> there.</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3">Remaps Capslock To Ctrl</h3>
<div class="outline-text-3" id="text-orgheadline3">
<ol class="org-ol">
<li>Go into the Keyboard preference pane.</li>
<li>Click "Modifier Keys…", and change Caps Lock to Control.</li>
<li>Download the lastest version of <a href="https://pqrs.org/osx/karabiner/seil.html.en">Seli</a>.</li>
<li>Open Seli and go <b>other keys</b> section to Change <b>Ctrl<sub>L</sub></b></li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4">Remaps Capslock to Escape</h3>
<div class="outline-text-3" id="text-orgheadline4">
<ol class="org-ol">
<li>Download the lastest version of <a href="https://pqrs.org/osx/karabiner/">Karabiner</a>.</li>
<li>go into Karabiner and search for this option:</li>
</ol>
<p class="verse">
Control<sub>L</sub> to Control<sub>L</sub><br  />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(+ when you type Control<sub>L</sub> only, send Escape)<br  />
</p>
</div>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6">Zsh Configuration</h2>
<div class="outline-text-2" id="text-orgheadline6">
<p>
I switched to zsh from bash a while, oh-my-zsh is first framwork I used. 
It is handy and well documented, but what did not stastify me is its slow startup times,
Antigen shares same issue with oh-my-zsh, finally I tried zplug and very happy with its speed and 
flexibility - To be able use plugins of oh-my-zsh and have better response time.
</p>

<p>
This configuration is specified for Mac users only because I moved to Mac from Linux since 2013.
</p>
</div>
<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7">Installation</h3>
<div class="outline-text-3" id="text-orgheadline7">
<div class="org-src-container">

<pre class="src src-sh">brew install zsh
git clone https://github.com/b4b4r07/zplug ~/.zplug
chsh -s /usr/local/bin/zsh
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8">Initialization</h3>
<div class="outline-text-3" id="text-orgheadline8">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #4f97d7;">source</span> ~/.zplug/zplug
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9">Command Search PATH</h3>
<div class="outline-text-3" id="text-orgheadline9">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #4f97d7;">export</span> <span style="color: #7590db;">PATH</span>=$<span style="color: #4f97d7;">{</span><span style="color: #7590db;">HOME</span><span style="color: #4f97d7;">}</span>/bin:$<span style="color: #4f97d7;">{</span><span style="color: #7590db;">HOME</span><span style="color: #4f97d7;">}</span>/.local/bin:/usr/local/bin:$<span style="color: #4f97d7;">{</span><span style="color: #7590db;">PATH</span><span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10">Default Editor</h3>
<div class="outline-text-3" id="text-orgheadline10">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #4f97d7;">export</span> <span style="color: #7590db;">EDITOR</span>=vim
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11">VIM mode</h3>
<div class="outline-text-3" id="text-orgheadline11">
<div class="org-src-container">

<pre class="src src-sh">zplug <span style="color: #2d9574;">"plugins/vi-mode"</span>, from:oh-my-zsh
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12">Theme</h3>
<div class="outline-text-3" id="text-orgheadline12">
<div class="org-src-container">

<pre class="src src-sh">zplug <span style="color: #2d9574;">"themes/pygmalion"</span>, from:oh-my-zsh
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13">Syntax Highlight</h3>
<div class="outline-text-3" id="text-orgheadline13">
<div class="org-src-container">

<pre class="src src-sh">zplug <span style="color: #2d9574;">"zsh-users/zsh-syntax-highlighting"</span>, nice:10
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14">History Search</h3>
<div class="outline-text-3" id="text-orgheadline14">
<p>
Type in any part of any previously entered command and press the UP and DOWN arrow keys to cycle 
through the matching commands. You can also use K and J in VI mode or ^P and ^N in EMACS mode for the same.
</p>
<div class="org-src-container">

<pre class="src src-sh">zplug <span style="color: #2d9574;">"zsh-users/zsh-history-substring-search"</span>
</pre>
</div>
</div>
<ul class="org-ul"><li><a id="orgheadline15"></a>Bind UP and DOWN arrow keys<br  /><div class="outline-text-4" id="text-orgheadline15">
<div class="org-src-container">

<pre class="src src-sh">zmodload zsh/terminfo
<span style="color: #4f97d7;">bindkey</span> <span style="color: #2d9574;">"$terminfo[kcuu1]"</span> history-substring-search-up
<span style="color: #4f97d7;">bindkey</span> <span style="color: #2d9574;">"$terminfo[kcud1]"</span> history-substring-search-down
</pre>
</div>
</div></li>
<li><a id="orgheadline16"></a>Bind P and N for EMACS mode<br  /><div class="outline-text-4" id="text-orgheadline16">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #4f97d7;">bindkey</span> -M emacs <span style="color: #2d9574;">'^P'</span> history-substring-search-up
<span style="color: #4f97d7;">bindkey</span> -M emacs <span style="color: #2d9574;">'^N'</span> history-substring-search-down
</pre>
</div>
</div></li>
<li><a id="orgheadline17"></a>Bind k and j for VI mode<br  /><div class="outline-text-4" id="text-orgheadline17">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #4f97d7;">bindkey</span> -M vicmd <span style="color: #2d9574;">'k'</span> history-substring-search-up
</pre>
</div>
</div></li></ul>
</div>
<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18">Git</h3>
<div class="outline-text-3" id="text-orgheadline18">
<div class="org-src-container">

<pre class="src src-sh">zplug <span style="color: #2d9574;">"plugins/git"</span>, from:oh-my-zsh
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline19" class="outline-3">
<h3 id="orgheadline19">OSX Enhancement</h3>
<div class="outline-text-3" id="text-orgheadline19">
<ul class="org-ul">
<li>brew auto completion.</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">zplug <span style="color: #2d9574;">"plugins/brew"</span>, from:oh-my-zsh
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline22" class="outline-3">
<h3 id="orgheadline22">NodeJS Development Env</h3>
<div class="outline-text-3" id="text-orgheadline22">
</div><ul class="org-ul"><li><a id="orgheadline20"></a>NPM auto completion<br  /><div class="outline-text-4" id="text-orgheadline20">
<div class="org-src-container">

<pre class="src src-sh">zplug <span style="color: #2d9574;">"plugins/npm"</span>, from:oh-my-zsh
</pre>
</div>
</div></li>
<li><a id="orgheadline21"></a>NVM setup<br  /><div class="outline-text-4" id="text-orgheadline21">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #4f97d7;">export</span> <span style="color: #7590db;">NVM_DIR</span>=~/.nvm
<span style="color: #4f97d7;">source</span> $<span style="color: #4f97d7;">(</span>brew --prefix nvm<span style="color: #4f97d7;">)</span>/nvm.sh
</pre>
</div>
</div></li></ul>
</div>
<div id="outline-container-orgheadline23" class="outline-3">
<h3 id="orgheadline23">Install plugins automatically</h3>
<div class="outline-text-3" id="text-orgheadline23">
<p>
zplug check return true if all plugins are installed
Therefore, when it returns not true (thus false),
run zplug install
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #a45bad;">!</span> zplug check; <span style="color: #4f97d7; font-weight: bold;">then</span>
    zplug install
<span style="color: #4f97d7; font-weight: bold;">fi</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline24" class="outline-3">
<h3 id="orgheadline24">Loads Zplug Plugins.</h3>
<div class="outline-text-3" id="text-orgheadline24">
<div class="org-src-container">

<pre class="src src-sh">zplug load --verbose
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline28" class="outline-3">
<h3 id="orgheadline28">Aliases &amp; Additonal Commands</h3>
<div class="outline-text-3" id="text-orgheadline28">
</div><ul class="org-ul"><li><a id="orgheadline25"></a>List all branchs in tig by default.<br  /><div class="outline-text-4" id="text-orgheadline25">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #4f97d7;">which</span> tig &gt;/dev/null     &amp;&amp; <span style="color: #4f97d7;">alias</span> <span style="color: #7590db;">tig</span>=tig --all
</pre>
</div>
</div></li>
<li><a id="orgheadline26"></a>Searches files with names containing a string<br  /><div class="outline-text-4" id="text-orgheadline26">
<p>
f: searches the current directory subtree for files with names containing a
string (ignoring case). f png would find all PNG files in the current subtree,
as well as “PNGisMyFavorite.txt” and so forth.
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">f</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span> find . -iname <span style="color: #2d9574;">"*$1*"</span> $<span style="color: #bc6ec5;">{</span><span style="color: #7590db;">@</span>:2<span style="color: #bc6ec5;">}</span> <span style="color: #4f97d7;">}</span>
</pre>
</div>
</div></li>
<li><a id="orgheadline27"></a>Greps the current directory subtree for files matching a pattern.<br  /><div class="outline-text-4" id="text-orgheadline27">
<p>
r: recursively greps the current directory subtree for files matching a pattern.
r HTTP would grep for files containing that exact string, while r '"http[^"]*"'
  -i would search for double-quoted strings starting with “http”, ignoring case.
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #4f97d7; font-weight: bold;">function </span><span style="color: #4f97d7;">r</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span> grep <span style="color: #2d9574;">"$1"</span> $<span style="color: #bc6ec5;">{</span><span style="color: #7590db;">@</span>:2<span style="color: #bc6ec5;">}</span> -R . <span style="color: #4f97d7;">}</span>
</pre>
</div>
</div></li></ul>
</div>
<div id="outline-container-orgheadline29" class="outline-3">
<h3 id="orgheadline29">Put it all together</h3>
<div class="outline-text-3" id="text-orgheadline29">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #4f97d7;">source</span> ~/.zplug/zplug

<span style="color: #4f97d7;">export</span> <span style="color: #7590db;">PATH</span>=$<span style="color: #4f97d7;">{</span><span style="color: #7590db;">HOME</span><span style="color: #4f97d7;">}</span>/bin:$<span style="color: #4f97d7;">{</span><span style="color: #7590db;">HOME</span><span style="color: #4f97d7;">}</span>/.local/bin:/usr/local/bin:$<span style="color: #4f97d7;">{</span><span style="color: #7590db;">PATH</span><span style="color: #4f97d7;">}</span>

<span style="color: #4f97d7;">export</span> <span style="color: #7590db;">EDITOR</span>=vim

zplug <span style="color: #2d9574;">"plugins/vi-mode"</span>, from:oh-my-zsh

zplug <span style="color: #2d9574;">"themes/pygmalion"</span>, from:oh-my-zsh

zplug <span style="color: #2d9574;">"zsh-users/zsh-syntax-highlighting"</span>, nice:10

zplug <span style="color: #2d9574;">"zsh-users/zsh-history-substring-search"</span>

zmodload zsh/terminfo
<span style="color: #4f97d7;">bindkey</span> <span style="color: #2d9574;">"$terminfo[kcuu1]"</span> history-substring-search-up
<span style="color: #4f97d7;">bindkey</span> <span style="color: #2d9574;">"$terminfo[kcud1]"</span> history-substring-search-down

<span style="color: #4f97d7;">bindkey</span> -M emacs <span style="color: #2d9574;">'^P'</span> history-substring-search-up
<span style="color: #4f97d7;">bindkey</span> -M emacs <span style="color: #2d9574;">'^N'</span> history-substring-search-down

<span style="color: #4f97d7;">bindkey</span> -M vicmd <span style="color: #2d9574;">'k'</span> history-substring-search-up

zplug <span style="color: #2d9574;">"plugins/git"</span>, from:oh-my-zsh

zplug <span style="color: #2d9574;">"plugins/brew"</span>, from:oh-my-zsh

zplug <span style="color: #2d9574;">"plugins/npm"</span>, from:oh-my-zsh

<span style="color: #4f97d7;">export</span> <span style="color: #7590db;">NVM_DIR</span>=~/.nvm
<span style="color: #4f97d7;">source</span> $<span style="color: #4f97d7;">(</span>brew --prefix nvm<span style="color: #4f97d7;">)</span>/nvm.sh

<span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #a45bad;">!</span> zplug check; <span style="color: #4f97d7; font-weight: bold;">then</span>
    zplug install
<span style="color: #4f97d7; font-weight: bold;">fi</span>

zplug load --verbose

<span style="color: #4f97d7;">which</span> tig &gt;/dev/null     &amp;&amp; <span style="color: #4f97d7;">alias</span> <span style="color: #7590db;">tig</span>=tig --all

<span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">f</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span> find . -iname <span style="color: #2d9574;">"*$1*"</span> $<span style="color: #bc6ec5;">{</span><span style="color: #7590db;">@</span>:2<span style="color: #bc6ec5;">}</span> <span style="color: #4f97d7;">}</span>

<span style="color: #4f97d7; font-weight: bold;">function </span><span style="color: #4f97d7;">r</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span> grep <span style="color: #2d9574;">"$1"</span> $<span style="color: #bc6ec5;">{</span><span style="color: #7590db;">@</span>:2<span style="color: #bc6ec5;">}</span> -R . <span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline30" class="outline-2">
<h2 id="orgheadline30">VIM Configuration</h2>
<div class="outline-text-2" id="text-orgheadline30">
<p>
Normally I use Emacs to write codes and documents, but sometimes 
I  do quick modification on terminal by using VIM. 
</p>
</div>
<div id="outline-container-orgheadline31" class="outline-3">
<h3 id="orgheadline31">Syntax Highlight</h3>
<div class="outline-text-3" id="text-orgheadline31">
<div class="org-src-container">

<pre class="src src-shell">syntax on
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline32" class="outline-3">
<h3 id="orgheadline32">Highlight and strip eatra white spaces</h3>
<div class="outline-text-3" id="text-orgheadline32">
<p>
Highlight existing trailing whitespace and also strip trailing 
whitespace.
</p>
<div class="org-src-container">

<pre class="src src-shell">highlight ExtraWhitespace <span style="color: #7590db;">ctermbg</span>=red <span style="color: #7590db;">guibg</span>=red
match ExtraWhitespace /\s<span style="color: #2d9574;">\+</span>$/
autocmd BufWinEnter * match ExtraWhitespace /\s<span style="color: #2d9574;">\+</span>$/
autocmd InsertEnter * match ExtraWhitespace /\s<span style="color: #2d9574;">\+\%</span>#<span style="color: #2d9574;">\@</span>&lt;!$/
autocmd InsertLeave * match ExtraWhitespace /\s<span style="color: #2d9574;">\+</span>$/
autocmd BufWinLeave * call clearmatches<span style="color: #4f97d7;">()</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Chen Hsin-Yi</p>
<p class="date">Created: 2016-03-28 Mon 14:14</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
